app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト７"], ["body", "aaa"], ["user_id", 1], ["created_at", "2021-10-22 08:07:50.836686"], ["updated_at", "2021-10-22 08:07:50.836686"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
  if @book.save
    redirect_to books_path(@book), notice: 'successfully'
  else
    @books = Book.all