app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "aaaabb"], ["profile_image_id", "2bac417d0db0f25a818171fb4ce1f2300efe6c124ca16e8ce24551bd8811"], ["updated_at", "2021-10-28 08:21:03.008294"], ["id", 6]]